[
    {
        "title":"คอมพิวเตอร์คืออะไร?",
        "subtitle":"คอมพิวเตอร์ คือ อุปกรณที่ใช่สำหรับการคำนวนและทำงานอื่นๆ",
        "imageUrl":"https://raw.githubusercontent.com/deardevilz/BasicAPI/main/computer.jpeg",
        "detail":"คอมพิวเตอร์ (อังกฤษ: computer) หรือศัพท์บัญญัติราชบัณฑิตยสภาว่า คณิตกรณ์[2][3] เป็นเครื่องจักรแบบสั่งการได้ที่ออกแบบมาเพื่อดำเนินการกับลำดับตัวดำเนินการทางตรรกศาสตร์หรือคณิตศาสตร์ โดยอนุกรมนี้อาจเปลี่ยนแปลงได้เมื่อพร้อม ส่งผลให้คอมพิวเตอร์สามารถแก้ปัญหาได้มากมาย\n\nคอมพิวเตอร์ถูกประดิษฐ์ออกมาให้ประกอบไปด้วยความจำรูปแบบต่าง ๆ เพื่อเก็บข้อมูล อย่างน้อยหนึ่งส่วนที่มีหน้าที่ดำเนินการคำนวณเกี่ยวกับตัวดำเนินการทางตรรกศาสตร์ และตัวดำเนินการทางคณิตศาสตร์ และส่วนควบคุมที่ใช้เปลี่ยนแปลงลำดับของตัวดำเนินการโดยยึดสารสนเทศที่ถูกเก็บไว้เป็นหลัก อุปกรณ์เหล่านี้จะยอมให้นำเข้าข้อมูลจากแหล่งภายนอก และส่งผลจากการคำนวณตัวดำเนินการออกไป"
    },
    {
        "title":"Flutter คือ?",
        "subtitle":"Tools สำหรับการออกแบบ UI ของ Google",
        "imageUrl":"https://raw.githubusercontent.com/deardevilz/BasicAPI/main/flutter.jpeg",
        "detail":"Flutter คือ Cross-Platform Framework ที่ใช้ในการพัฒนา Native Mobile Application (Android/iOS) พัฒนาโดยบริษัท Google Inc. โดยใช้ภาษา Dart ในการพัฒนา ที่มีความคล้ายกับภาษา C# และ Java\n\nอีกหนึ่งจุดเด่นของ Flutter คือ การปรับแต่ง UI (User Interface) ที่มีความยืนหยุ่น แยกการออกแบบเพื่อเน้นไปที่ประสบการณ์ของผู้ใช้งาน UX (User Experience) โดย UI จะใกล้เคียงกับ Native และตรงตาม Design Guideline ที่ถูกต้อง และมีความสามารถในการทำ Hot Reload ที่ทำให้การแก้ไขโค้ดสามารถแสดงผลได้ทันทีในระหว่างที่รันแอปพลิเคชัน และยังรวมไปถึงมี Widget ที่พร้อมให้เลือกใช้มากมาย ทำให้พัฒนาแอปพลิเคชันได้ไวเหมาะสำหรับองค์กรที่ต้องการแอปที่สวยงามและมีประสิทธิภาพ\n\nในหลักสูตรมีการสอน State Management โดยใช้ BLoC (Business Logic Component) ที่นิยมในกลุ่มนักพัฒนา Flutter ในการจัดการ Local/Global State เพื่อรองรับระบบที่มีขนาดใหญ่และซับซ้อน ดูเป็นมืออาชีพ รวมถึงการเขียนโค้ดที่ทำงานร่วมกับ Native API โดยใช้ภาษาสมัยใหม่อย่าง Kotlin และ Swift เพื่อให้ผู้เข้าอบรมสามารถรับมือกับ Requirement ที่ต้องเชื่อมต่อกับ Native Android และ iOS"
    },
    {
        "title":"Python คือ?",
        "subtitle":"ภาษาเขียนโปรแกรมชนิดนึง สร้างขึ้นเมื่อปี 1991",
        "imageUrl":"https://raw.githubusercontent.com/deardevilz/BasicAPI/main/python.png",
        "detail":"ภาษาไพธอน (Python) เป็นภาษาการเขียนโปรแกรมระดับสูง ที่นำข้อดีของภาษาต่างๆ มารวมไว้ด้วยกัน ถูกออกแบบมาให้เรียนรู้ได้ง่าย และมีไวยากรณ์ที่ช่วยให้เขียนโค้ดสั้นกว่าภาษาอื่นๆ มีความสามารถใช้ชนิดข้อมูลแบบไดนามิก จัดการหน่วยความจำอัตโนมัติ สนับสนุนกระบวนทัศน์การเขียนโปรแกรม (Programming paradigms) ประกอบด้วย การเขียนโปรแกรมเชิงวัตถุ (OOP : Object Oriented Programming) การเขียนโปรแกรมเชิงคำสั่ง (Imperative Programming) การเขียนโปรแกรมเชิงฟังก์ชั่น (Functional)\n\nและการเขียนโปรแกรมเชิงกระบวนการ มีลักษณะเป็นภาษาสคริปต์ที่ทำงานร่วมกับภาษาอื่นได้ มีไลบรารี่มาตรฐานมากมาย และใช้อินเตอร์พรีเตอร์แปลภาษาโปรแกรมให้ทำงานบนระบบปฎิบัติการได้หลากหลาย ทั้งบน Windows, MAC, Linux และ Unix นอกจากนั้นยังเป็นโปรแกรมแบบ Oepn source ที่นำใช้ได้ฟรี เหมาะสำหรับโปรแกรมทั้งขนาดเล็กแบะขนาดใหญ่ เช่น การสร้างเกม เฟรมเวิร์กพัฒนาเว็บ โปรแกรมที่ใช้กราฟิกติดต่อกับผู้ใช้งาน (GUI) งานคำนวนทางวิทยาศาสตร์และสถิติ งานพัฒนาซอฟแวร์ และซอฟแวร์ควบคุมระบบ เป็นต้น"
    }
]
